---
kind: method
id: M:Autodesk.Revit.DB.IPerformanceAdviserRule.FinalizeCheck(Autodesk.Revit.DB.Document)
source: html/b2b88e8f-571a-8bc8-1570-5c492c147dea.htm
---
# Autodesk.Revit.DB.IPerformanceAdviserRule.FinalizeCheck Method

Invoked by performance advisor once in the end of the check.

## Syntax (C#)
```csharp
void FinalizeCheck(
	Document document
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - Document for which performance problems are being checked.